posts/specialized-workers-pattern/index.org
#+BEGIN_COMMENT
.. title: Introducing the Specialized Workers pattern
.. slug: specialized-workers-pattern
.. date: 2024-05-12 11:09:45 UTC+03:00
.. tags:
.. category:
.. link:
.. description:
.. type: text
.. status: draft
#+END_COMMENT
* Introduction

Some years ago, in my [[link://slug/using-enums-in-c-sharp][blog post about using enums in C#]] I mentioned that I like using what I called at that time =specialized builders= to refactor the =switch= statement into a series of classes that implement a common interface and are specialized for a specific =case= of the =switch= statement.

For the past few years I have been showing to my colleagues a slightly improved version of this approach (the topic of this post) and they all seem to agree that this is indeed a cleaner, and more elegant approach which, unlike the infamous =switch= statement does abide by the [[https://en.wikipedia.org/wiki/Open/closed_principle][Open/Closed principle]].

As such, I am excited to introduce to the world the =Specialized Workers= pattern.

* Specialized Workers Pattern

** Description and usage

The =Specialized Workers= pattern aims to distribute the logic of a business operation that requires choosing between one or multiple tasks to be executed, into a collection of specialized classes, while keeping the knowledge about the task(s) to be executed into a single place.

Under these circumstances each worker knows about the data just enough to know whether it /can accomplish the task/, and /how to accomplish/ it.

Usually (at least from my experience), the decision to delegate a certain sub task was made by the unit that is in charge of delegating. In an abstract representation the code would look something like this:
#+begin_src csharp
  if(SomeCondition())
  {
      DoWorkForConditionAbove();
  }
#+end_src
where the method that contains the snippet above /delegates/ the processing to the =DoWorkForConditionAbove()= method.

However, when the decision whether to delegate to a specific unit or not depends on the data that is to be processed, taking that decision couples both the delegator, and the worker unit to the structure of the data.

It is normal for the worker to be coupled to the structure of the data because it has to know the structure in order to be able to process it but the delegator, which now becomes a coordinator, doesn't have to know the structure of the data.

Consider the example of an unit that has to parse an =HTML= element and has to make the following decision:
- if the current node is a =div= then =ParseDivElement()= should be called,
- if the current node is a =table= then =ParseTableElement()= should be called, and
- if the current element is none of the above, it should just ignore it.

Put differently than at the beginning of this section,  the purpose of =Specialized Workers= pattern is to:
- delegate the work to a single place, and
- enclose in a single place /the knowledge about being able to perform a specific task/ and /the knowledge required to perform that task/.

