posts/specialized-workers-pattern/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Rebeja · Introducing the Specialized Workers pattern </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="http://fonts.googleapis.com/css?family=PT+Sans:400,400italic,700|Abril+Fatface">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/fork-awesome@1.1.7/css/fork-awesome.min.css" integrity="sha256-gsmEoJAws/Kd3CjuOQzLie5Q3yshhvmo7YNtBG7aaEY=" crossorigin="anonymous">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://rebeja.eu/posts/specialized-workers-pattern/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Petru Rebeja">
<link rel="prev" href="../release-to-qa-not-production/" title="Don't release to Production, release to QA" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <div class="hsidebar">
        <div class="container sidebar-sticky">
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../index.html" title="Home"><i class="fa fa-home"></i>Home</a>
            <a class="sidebar-nav-item" href="../../archive.html" title="Archive"><i class="fa fa-folder-open"></i>Archive</a>
            <a class="sidebar-nav-item" href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i>Tags</a>
            <a class="sidebar-nav-item" href="../../pages/welcome/" title="About"><i class="fa fa-user"></i>About</a>
            <a class="sidebar-nav-item" href="../../tehnologii-web/" title="Teaching"><i class="fa fa-graduation-cap"></i>Teaching</a>
            <a class="sidebar-nav-item" href="../../pages/en-ro-dictionary-for-ai" title="EN-RO 4 AI"><i class="fa fa-book"></i>EN-RO 4 AI</a>
            <a class="sidebar-nav-item" href="../../rss.xml" title="RSS"><i class="fa fa-feed"></i>RSS</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2025         <a href="mailto:petru.rebeja@gmail.com">Petru Rebeja</a> - Powered by   <a href="https://www.gnu.org/software/emacs/" rel="nofollow">GNU Emacs</a>  &amp;    <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>
    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Introducing the Specialized Workers pattern</a></h1>

    <p class="dateline">
      <i class="fa fa-clock-o"></i> <time class="published dt-published" datetime="2024-05-12T11:09:45+03:00" itemprop="datePublished" title="2024-05-12 11:09">2024-05-12 11:09</time>   |   <i class="fa fa-user"></i> 
         Petru Rebeja
      
      
    </p>
    

    <div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org3e3fc1c" class="outline-2">
<h2 id="org3e3fc1c">Introduction</h2>
<div class="outline-text-2" id="text-org3e3fc1c">
<p>
Some years ago, in my <a href="../using-enums-in-c-sharp/">blog post about using enums in C#</a> I mentioned that I like using what I called at that time <code>specialized builders</code> to refactor the <code>switch</code> statement into a series of classes that implement a common interface and are specialized for a specific <code>case</code> of the <code>switch</code> statement.
</p>

<p>
For the past few years I have been showing to my colleagues a slightly improved version of this approach (the topic of this post) and they all seem to agree that this is indeed a cleaner, and more elegant approach which, unlike the infamous <code>switch</code> statement does abide by the <a href="https://en.wikipedia.org/wiki/Open/closed_principle">Open/Closed principle</a>.
</p>

<p>
As such, I am excited to introduce to the world the <code>Specialized Workers</code> pattern.
</p>
</div>
</div>

<div id="outline-container-orgdc5a2de" class="outline-2">
<h2 id="orgdc5a2de">Specialized Workers Pattern</h2>
<div class="outline-text-2" id="text-orgdc5a2de">
</div>
<div id="outline-container-org99d1329" class="outline-3">
<h3 id="org99d1329">Description and usage</h3>
<div class="outline-text-3" id="text-org99d1329">
<p>
The <code>Specialized Workers</code> pattern aims to distribute the logic of a business operation that requires choosing between one or multiple tasks to be executed, into a collection of specialized classes, while keeping the knowledge about the task(s) to be executed into a single place.
</p>

<p>
Under these circumstances each worker knows about the data just enough to know whether it <i>can accomplish the task</i>, and <i>how to accomplish</i> it.
</p>

<p>
Usually (at least from my experience), the decision to delegate a certain sub task was made by the unit that is in charge of delegating. In an abstract representation the code would look something like this:
</p>
<div class="highlight"><pre><span></span><span class="k">if</span><span class="p">(</span><span class="n">SomeCondition</span><span class="p">())</span>
<span class="p">{</span>
<span class="w">    </span><span class="n">DoWorkForConditionAbove</span><span class="p">();</span>
<span class="p">}</span>
</pre></div>
<p>
where the method that contains the snippet above <i>delegates</i> the processing to the <code>DoWorkForConditionAbove()</code> method.
</p>

<p>
However, when the decision whether to delegate to a specific unit or not depends on the data that is to be processed, taking that decision couples both the delegator, and the worker unit to the structure of the data.
</p>

<p>
It is normal for the worker to be coupled to the structure of the data because it has to know the structure in order to be able to process it but the delegator, which now becomes a coordinator, doesn't have to know the structure of the data.
</p>

<p>
Consider the example of an unit that has to parse an <code>HTML</code> element and has to make the following decision:
</p>
<ul class="org-ul">
<li>if the current node is a <code>div</code> then <code>ParseDivElement()</code> should be called,</li>
<li>if the current node is a <code>table</code> then <code>ParseTableElement()</code> should be called, and</li>
<li>if the current element is none of the above, it should just ignore it.</li>
</ul>
<p>
Put differently than at the beginning of this section,  the purpose of <code>Specialized Workers</code> pattern is to:
</p>
<ul class="org-ul">
<li>delegate the work to a single place, and</li>
<li>enclose in a single place <i>the knowledge about being able to perform a specific task</i> and <i>the knowledge required to perform that task</i>.</li>
</ul>
</div>
</div>
