posts/specialized-workers-pattern/index.org
** Implementation
:PROPERTIES:
:CUSTOM_ID: implementation
:END:

Now that we established what =Specialized Workers= pattern is, let's see how it can be implemented.

It goes without saying that when implementing this pattern, the  amount of work directly depends on how many workers the business case requires (i.e. how many =switch= cases are there) but, in broad lines, to implement the =Specialized Workers= pattern you'll need to:
- Define a interface for the worker exposing two methods --- =CanProcess()=, and =Process()=:
#+begin_src csharp
  public interface ISpecializedWorker
  {
      bool CanProcess(Payload payload);

      Result Process(Payload payload);
  }
#+end_src
- Add a class for each use-case:
#+begin_src csharp
  internal class MondayPayloadWorker: ISpecializedWorker
  {
      public bool CanProcess(Payload payload)
      {
          return payload.DayOfWeek = DayOfWeek.Monday;
      }

      public Result Process(Payload payload)
      {
          return ProcessInternal(payload);
      }
  }
#+end_src
- Inject the workers into the calling class (the =Employer=), and delegate:
#+begin_src csharp
  internal class Employer
  {
      private readonly IEnumerable<ISpecializedWorker> _workers;

      public Employer(IEnumerable<ISpecializedWorker> workers)
      {
          _workers = workers;
      }

      public Result Process(Payload payload)
      {
          var worker = _workers.SingleOrDefault(
              w => w.CanProcess(payload));

          // This is the equivalent of the default case
          // in the switch statement.
          if (worker == null)
          {
              throw new ArgumentException(
                  "Cannot process the provided payload.");
          }

          return worker.Process(payload);
      }
  }
#+end_src

And that's all there is to it. Now, the =Employer= class is agnostic of how the =payload= is processed; it just delegates the processing to the worker that can handle it. If no workers that are able to process the =payload= are found, the =Employer= class can choose to signal this by either raising an exception, returning a default value or any other mechanism that is suited to the other patterns used in the code-base. More on this in section [[*Adaptations][Adaptations]]. Furthermore, the =Employer= class doesn't have to know how many workers are there; as such, the workers can be added or removed without any change to the =Employer= class, which means that the class is /decoupled/ from the workers.

On the other hand, each worker class is, as the name of the pattern suggests it, /specialized/ to do one thing --- work on the specific use-case it knows all about: whether it can process it, and if yes, then it also knows how to process it.

* Discussion

** How is it different from the =Strategy= pattern?

At this moment you may be wondering how the =Specialized Workers= is different from the =Strategy= pattern? After all, each worker implements and applies a different strategy in the processing of the data.

To put it simply, the =Specialized Workers= pattern is not different from the =Strategy= design pattern; it evolves from it, with the added behavior that the caller (coordinator --- the =Employee= class from above) doesn't have to know explicitly which worker to employ. The worker to employ is selected based on its knowledge of the payload (i.e. based on the workers' "expertise") which, as mentioned before, makes the coordinator agnostic of the payload. As such, all the knowledge that is related to how to do a specific processing is kept in the same class where the processing happens.

There is however, a difference in the nomenclature: =Strategy= is a /design pattern/ whilst =Specialized Workers= is an /implementation pattern/. The difference between a design pattern and an implementation pattern deserves a dedicated post but to put it shortly, an implementation pattern tells you how you should write your code while a design pattern specifies how the application should be structured.

