posts/specialized-workers-pattern/index.html

<div id="outline-container-implementation" class="outline-3">
<h3 id="implementation">Implementation</h3>
<div class="outline-text-3" id="text-implementation">
<p>
Now that we established what <code>Specialized Workers</code> pattern is, let's see how it can be implemented.
</p>

<p>
It goes without saying that when implementing this pattern, the  amount of work directly depends on how many workers the business case requires (i.e. how many <code>switch</code> cases are there) but, in broad lines, to implement the <code>Specialized Workers</code> pattern you'll need to:
</p>
<ul class="org-ul">
<li>Define a interface for the worker exposing two methods — <code>CanProcess()</code>, and <code>Process()</code>:</li>
</ul>
<div class="highlight"><pre><span></span><span class="k">public</span><span class="w"> </span><span class="k">interface</span><span class="w"> </span><span class="n">ISpecializedWorker</span>
<span class="p">{</span>
<span class="w">    </span><span class="kt">bool</span><span class="w"> </span><span class="nf">CanProcess</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">);</span>

<span class="w">    </span><span class="n">Result</span><span class="w"> </span><span class="nf">Process</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">);</span>
<span class="p">}</span>
</pre></div>
<ul class="org-ul">
<li>Add a class for each use-case:</li>
</ul>
<div class="highlight"><pre><span></span><span class="k">internal</span><span class="w"> </span><span class="k">class</span><span class="w"> </span><span class="nc">MondayPayloadWorker</span><span class="p">:</span><span class="w"> </span><span class="n">ISpecializedWorker</span>
<span class="p">{</span>
<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="kt">bool</span><span class="w"> </span><span class="nf">CanProcess</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="n">payload</span><span class="p">.</span><span class="n">DayOfWeek</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">DayOfWeek</span><span class="p">.</span><span class="n">Monday</span><span class="p">;</span>
<span class="w">    </span><span class="p">}</span>

<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="n">Result</span><span class="w"> </span><span class="nf">Process</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="nf">ProcessInternal</span><span class="p">(</span><span class="n">payload</span><span class="p">);</span>
<span class="w">    </span><span class="p">}</span>
<span class="p">}</span>
</pre></div>
<ul class="org-ul">
<li>Inject the workers into the calling class (the <code>Employer</code>), and delegate:</li>
</ul>
<div class="highlight"><pre><span></span><span class="k">internal</span><span class="w"> </span><span class="k">class</span><span class="w"> </span><span class="nc">Employer</span>
<span class="p">{</span>
<span class="w">    </span><span class="k">private</span><span class="w"> </span><span class="k">readonly</span><span class="w"> </span><span class="n">IEnumerable</span><span class="o">&lt;</span><span class="n">ISpecializedWorker</span><span class="o">&gt;</span><span class="w"> </span><span class="n">_workers</span><span class="p">;</span>

<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="nf">Employer</span><span class="p">(</span><span class="n">IEnumerable</span><span class="o">&lt;</span><span class="n">ISpecializedWorker</span><span class="o">&gt;</span><span class="w"> </span><span class="n">workers</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="n">_workers</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">workers</span><span class="p">;</span>
<span class="w">    </span><span class="p">}</span>

<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="n">Result</span><span class="w"> </span><span class="nf">Process</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="kt">var</span><span class="w"> </span><span class="n">worker</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">_workers</span><span class="p">.</span><span class="n">SingleOrDefault</span><span class="p">(</span>
<span class="w">            </span><span class="n">w</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">w</span><span class="p">.</span><span class="n">CanProcess</span><span class="p">(</span><span class="n">payload</span><span class="p">));</span>

<span class="w">        </span><span class="c1">// This is the equivalent of the default case</span>
<span class="w">        </span><span class="c1">// in the switch statement.</span>
<span class="w">        </span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="n">worker</span><span class="w"> </span><span class="o">==</span><span class="w"> </span><span class="k">null</span><span class="p">)</span>
<span class="w">        </span><span class="p">{</span>
<span class="w">            </span><span class="k">throw</span><span class="w"> </span><span class="k">new</span><span class="w"> </span><span class="nf">ArgumentException</span><span class="p">(</span>
<span class="w">                </span><span class="s">"Cannot process the provided payload."</span><span class="p">);</span>
<span class="w">        </span><span class="p">}</span>

<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="n">worker</span><span class="p">.</span><span class="n">Process</span><span class="p">(</span><span class="n">payload</span><span class="p">);</span>
<span class="w">    </span><span class="p">}</span>
<span class="p">}</span>
</pre></div>

<p>
And that's all there is to it. Now, the <code>Employer</code> class is agnostic of how the <code>payload</code> is processed; it just delegates the processing to the worker that can handle it. If no workers that are able to process the <code>payload</code> are found, the <code>Employer</code> class can choose to signal this by either raising an exception, returning a default value or any other mechanism that is suited to the other patterns used in the code-base. More on this in section <a href="#adaptations">Adaptations</a>. Furthermore, the <code>Employer</code> class doesn't have to know how many workers are there; as such, the workers can be added or removed without any change to the <code>Employer</code> class, which means that the class is <i>decoupled</i> from the workers.
</p>

<p>
On the other hand, each worker class is, as the name of the pattern suggests it, <i>specialized</i> to do one thing — work on the specific use-case it knows all about: whether it can process it, and if yes, then it also knows how to process it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcdd5cda" class="outline-2">
<h2 id="orgcdd5cda">Discussion</h2>
<div class="outline-text-2" id="text-orgcdd5cda">
</div>
<div id="outline-container-orge09cf18" class="outline-3">
<h3 id="orge09cf18">How is it different from the <code>Strategy</code> pattern?</h3>
<div class="outline-text-3" id="text-orge09cf18">
<p>
At this moment you may be wondering how the <code>Specialized Workers</code> is different from the <code>Strategy</code> pattern? After all, each worker implements and applies a different strategy in the processing of the data.
</p>

<p>
To put it simply, the <code>Specialized Workers</code> pattern is not different from the <code>Strategy</code> design pattern; it evolves from it, with the added behavior that the caller (coordinator — the <code>Employee</code> class from above) doesn't have to know explicitly which worker to employ. The worker to employ is selected based on its knowledge of the payload (i.e. based on the workers' "expertise") which, as mentioned before, makes the coordinator agnostic of the payload. As such, all the knowledge that is related to how to do a specific processing is kept in the same class where the processing happens.
</p>

<p>
There is however, a difference in the nomenclature: <code>Strategy</code> is a <i>design pattern</i> whilst <code>Specialized Workers</code> is an <i>implementation pattern</i>. The difference between a design pattern and an implementation pattern deserves a dedicated post but to put it shortly, an implementation pattern tells you how you should write your code while a design pattern specifies how the application should be structured.
</p>
</div>
</div>
