posts/specialized-workers-pattern/index.org
** Why not use a =Factory method=?

Okay, you might say, then why not use a =Factory method= to build directly the worker that knows how to handle the specific use-case?

Well, because the answer to this question is actually one of the benefits that come with implementing the =Specialized Workers= pattern, namely that it keeps the specialized logic within the same class.

When applying the =Factory method=, the decision on which instance to build is separated from the actual processing that needs to take place. From the point of view of the separation of concerns this is OK; however one might argue that, in order to decide which worker to build, the factory has to either apply some business knowledge, or be coupled to the data (by being aware of its structure). When applying the =Specialized Workers= pattern, all the business logic that is coupled to the data is in a single place, i. e. the class of the specialized worker.

Furthermore, when implementing the =Specialized Workers= pattern, you don't need to create instances of workers by hand as you do with the =Factory method=; the creation of the workers can be delegated to the =Dependency Injection= frameworks.

However, if the instantiation of the specialized workers depends o some parameters that cannot be easily built using the =Dependency Injection= framework, you'll need to use =Factory method=. In this case you can combine these two approaches: use the =Factory method= to build the specialized workers, and then pass them to the coordinator class that needs them. Keep in mind that this approach of combining the two patterns works if building each worker is an /inexpensive/ operation; otherwise you'll end-up spending resources to create instances that may not be used.

* Drawbacks
:PROPERTIES:
:CUSTOM_ID: drawbacks
:END:

As we all know, there are no perfect solutions, especially in software development. This is also the case for the =Specialized Workers= pattern, and as such, it has a few drawbacks listed below.

** No guarantee of the same parameters
:PROPERTIES:
:CUSTOM_ID: no-guarantee-of-the-same-parameters
:END:

The first drawback of the =Specialized Workers= pattern stems from the fact that the methods =CanProcess()=, and =Process()= are not constrained in any way to be called in the specific order they are meant to be called. Furthermore, there is also no guarantee whatsoever that these methods are called with the same parameter. The lack of constraints on the order of the calls, and on the parameters means that the caller may choose to ignore the results of the =CanProcess()= method, or not call it at all, and then invoke the =Process()= method.

There are (at least) two ways to work around this misuse: to combine the two methods into a single one, as presented in sub-section [[*Using a single method][Using a single method]], and to simply  guard against invalid arguments using =Debug.Assert()= or any of its equivalents:
#+begin_src csharp
  public Result Process(Payload payload) //
  {
      Debug.Assert(CanProcess(payload));

      // Do the work
  }
#+end_src

** Sensitivity to collections
:PROPERTIES:
:CUSTOM_ID: sensitivity-to-collections
:END:

While using the =Specialized Workers= pattern, you should be cautions when calling =CanProcess()= on collections. Ideally, the method =CanProcess()= should take the decision without iterating any collection of items. There are two intertwined reasons for that:  performance, and lazy loading.

If you have a heterogeneous collection, you can iterate through it in the delegator and call =CanProcess()= on each item in the collection. At the end, the delegator aggregates the results.
#+begin_src csharp
  class Employer
  {
      private readonly IEnumerable<ISpecializedWorker> _workers;

      public Employer(IEnumerable<ISpecializedWorker> workers)
      {
          _workers = workers;
      }

      public Result ProcessCollection(IEnumerable<Item> collection)
      {
          var partialResults = new List<Result>();
          foreach(var item in collection)
          {
              var itemResults = _workers
                  .Where(w => w.CanProcess(item))
                  .Select(w => w.Process(item));
              partialResults.AddRange(itemResults);
          }

          return partialResults.Aggregate(/*...*/);
      }
  }
#+end_src
This ensures that the collection is iterated only once thus avoiding any odd results due to lazy evaluation.

* Adaptations
:PROPERTIES:
:CUSTOM_ID: adaptations
:END:

Despite its drawbacks, the =Specialized Workers= pattern is quite flexible in its implementation. As such, it can be adapted for some specific scenarios discussed below. Of course, it goes without saying that the list is not exclusive.

