posts/specialized-workers-pattern/index.html

<div id="outline-container-org0b50983" class="outline-3">
<h3 id="org0b50983">Why not use a <code>Factory method</code>?</h3>
<div class="outline-text-3" id="text-org0b50983">
<p>
Okay, you might say, then why not use a <code>Factory method</code> to build directly the worker that knows how to handle the specific use-case?
</p>

<p>
Well, because the answer to this question is actually one of the benefits that come with implementing the <code>Specialized Workers</code> pattern, namely that it keeps the specialized logic within the same class.
</p>

<p>
When applying the <code>Factory method</code>, the decision on which instance to build is separated from the actual processing that needs to take place. From the point of view of the separation of concerns this is OK; however one might argue that, in order to decide which worker to build, the factory has to either apply some business knowledge, or be coupled to the data (by being aware of its structure). When applying the <code>Specialized Workers</code> pattern, all the business logic that is coupled to the data is in a single place, i. e. the class of the specialized worker.
</p>

<p>
Furthermore, when implementing the <code>Specialized Workers</code> pattern, you don't need to create instances of workers by hand as you do with the <code>Factory method</code>; the creation of the workers can be delegated to the <code>Dependency Injection</code> frameworks.
</p>

<p>
However, if the instantiation of the specialized workers depends o some parameters that cannot be easily built using the <code>Dependency Injection</code> framework, you'll need to use <code>Factory method</code>. In this case you can combine these two approaches: use the <code>Factory method</code> to build the specialized workers, and then pass them to the coordinator class that needs them. Keep in mind that this approach of combining the two patterns works if building each worker is an <i>inexpensive</i> operation; otherwise you'll end-up spending resources to create instances that may not be used.
</p>
</div>
</div>
</div>

<div id="outline-container-drawbacks" class="outline-2">
<h2 id="drawbacks">Drawbacks</h2>
<div class="outline-text-2" id="text-drawbacks">
<p>
As we all know, there are no perfect solutions, especially in software development. This is also the case for the <code>Specialized Workers</code> pattern, and as such, it has a few drawbacks listed below.
</p>
</div>

<div id="outline-container-no-guarantee-of-the-same-parameters" class="outline-3">
<h3 id="no-guarantee-of-the-same-parameters">No guarantee of the same parameters</h3>
<div class="outline-text-3" id="text-no-guarantee-of-the-same-parameters">
<p>
The first drawback of the <code>Specialized Workers</code> pattern stems from the fact that the methods <code>CanProcess()</code>, and <code>Process()</code> are not constrained in any way to be called in the specific order they are meant to be called. Furthermore, there is also no guarantee whatsoever that these methods are called with the same parameter. The lack of constraints on the order of the calls, and on the parameters means that the caller may choose to ignore the results of the <code>CanProcess()</code> method, or not call it at all, and then invoke the <code>Process()</code> method.
</p>

<p>
There are (at least) two ways to work around this misuse: to combine the two methods into a single one, as presented in sub-section <a href="#using-a-single-method">Using a single method</a>, and to simply  guard against invalid arguments using <code>Debug.Assert()</code> or any of its equivalents:
</p>
<div class="highlight"><pre><span></span><span class="k">public</span><span class="w"> </span><span class="n">Result</span><span class="w"> </span><span class="nf">Process</span><span class="p">(</span><span class="n">Payload</span><span class="w"> </span><span class="n">payload</span><span class="p">)</span><span class="w"> </span><span class="c1">//</span>
<span class="p">{</span>
<span class="w">    </span><span class="n">Debug</span><span class="p">.</span><span class="n">Assert</span><span class="p">(</span><span class="n">CanProcess</span><span class="p">(</span><span class="n">payload</span><span class="p">));</span>

<span class="w">    </span><span class="c1">// Do the work</span>
<span class="p">}</span>
</pre></div>
</div>
</div>

<div id="outline-container-sensitivity-to-collections" class="outline-3">
<h3 id="sensitivity-to-collections">Sensitivity to collections</h3>
<div class="outline-text-3" id="text-sensitivity-to-collections">
<p>
While using the <code>Specialized Workers</code> pattern, you should be cautions when calling <code>CanProcess()</code> on collections. Ideally, the method <code>CanProcess()</code> should take the decision without iterating any collection of items. There are two intertwined reasons for that:  performance, and lazy loading.
</p>

<p>
If you have a heterogeneous collection, you can iterate through it in the delegator and call <code>CanProcess()</code> on each item in the collection. At the end, the delegator aggregates the results.
</p>
<div class="highlight"><pre><span></span><span class="k">class</span><span class="w"> </span><span class="nc">Employer</span>
<span class="p">{</span>
<span class="w">    </span><span class="k">private</span><span class="w"> </span><span class="k">readonly</span><span class="w"> </span><span class="n">IEnumerable</span><span class="o">&lt;</span><span class="n">ISpecializedWorker</span><span class="o">&gt;</span><span class="w"> </span><span class="n">_workers</span><span class="p">;</span>

<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="nf">Employer</span><span class="p">(</span><span class="n">IEnumerable</span><span class="o">&lt;</span><span class="n">ISpecializedWorker</span><span class="o">&gt;</span><span class="w"> </span><span class="n">workers</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="n">_workers</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">workers</span><span class="p">;</span>
<span class="w">    </span><span class="p">}</span>

<span class="w">    </span><span class="k">public</span><span class="w"> </span><span class="n">Result</span><span class="w"> </span><span class="nf">ProcessCollection</span><span class="p">(</span><span class="n">IEnumerable</span><span class="o">&lt;</span><span class="n">Item</span><span class="o">&gt;</span><span class="w"> </span><span class="n">collection</span><span class="p">)</span>
<span class="w">    </span><span class="p">{</span>
<span class="w">        </span><span class="kt">var</span><span class="w"> </span><span class="n">partialResults</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="k">new</span><span class="w"> </span><span class="n">List</span><span class="o">&lt;</span><span class="n">Result</span><span class="o">&gt;</span><span class="p">();</span>
<span class="w">        </span><span class="k">foreach</span><span class="p">(</span><span class="kt">var</span><span class="w"> </span><span class="n">item</span><span class="w"> </span><span class="k">in</span><span class="w"> </span><span class="n">collection</span><span class="p">)</span>
<span class="w">        </span><span class="p">{</span>
<span class="w">            </span><span class="kt">var</span><span class="w"> </span><span class="n">itemResults</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="n">_workers</span>
<span class="w">                </span><span class="p">.</span><span class="n">Where</span><span class="p">(</span><span class="n">w</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">w</span><span class="p">.</span><span class="n">CanProcess</span><span class="p">(</span><span class="n">item</span><span class="p">))</span>
<span class="w">                </span><span class="p">.</span><span class="n">Select</span><span class="p">(</span><span class="n">w</span><span class="w"> </span><span class="o">=&gt;</span><span class="w"> </span><span class="n">w</span><span class="p">.</span><span class="n">Process</span><span class="p">(</span><span class="n">item</span><span class="p">));</span>
<span class="w">            </span><span class="n">partialResults</span><span class="p">.</span><span class="n">AddRange</span><span class="p">(</span><span class="n">itemResults</span><span class="p">);</span>
<span class="w">        </span><span class="p">}</span>

<span class="w">        </span><span class="k">return</span><span class="w"> </span><span class="n">partialResults</span><span class="p">.</span><span class="n">Aggregate</span><span class="p">(</span><span class="cm">/*...*/</span><span class="p">);</span>
<span class="w">    </span><span class="p">}</span>
<span class="p">}</span>
</pre></div>
<p>
This ensures that the collection is iterated only once thus avoiding any odd results due to lazy evaluation.
</p>
</div>
</div>
</div>

<div id="outline-container-adaptations" class="outline-2">
<h2 id="adaptations">Adaptations</h2>
<div class="outline-text-2" id="text-adaptations">
<p>
Despite its drawbacks, the <code>Specialized Workers</code> pattern is quite flexible in its implementation. As such, it can be adapted for some specific scenarios discussed below. Of course, it goes without saying that the list is not exclusive.
</p>
</div>
